Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/justice/courtroom/the_role_of_witnesses.html.txt.tmx
Source language: en
Languages: ga

source: The role of witnesses
ga: An ról atá ag finnéithe

source: Witnesses in Ireland are people who have been called to give evidence in court
ga: Daoine iad ar iarradh orthu fianaise a thabhairt i gcúirt is ea finnéithe

source: The witness's name is called and they go into the witness box at one side of the judge
ga: Fograítear ainm an fhinné agus téann sé nó sí isteach i gclár na mionn atá ar thaobh amháin den bhreitheamh

source: They stand in the witness box to repeat the oath or affirmation and then sit down
ga: Seasfaidh sé nó sí i mbosca na mionn chun mionn nó dearbhascadh a athrá agus ansin suífidh sé nó sí síos

source: The witness is then asked a series of questions by the barristers (or solicitors) in the case
ga: Cuirfidh na habhcóidí (nó na aturnaetha) sa chás sraith de cheisteanna ansin ar an bhfinné

source: The witness's function is to give evidence to the court
ga: Is í feidhm an fhinné fianaise a thabhairt don chúirt

source: For example, the witness may have seen a robbery take place and may be able to tell the court what they saw
ga: Mar shampla, b'fhéidir go bhfaca an finné robáil ag tarlú agus b'fhéidir go mbeadh sé/sí in ann a rá leis an gcúirt céard a chonaic sé/sí

source: This evidence may help the judge or the jury to make its decision
ga: D'fhéadfadh an fhianaise seo cabhrú leis an mbreitheamh nó leis an ngiúiré cinneadh a dhéanamh

source: Further information about being a witness in a court case in Ireland is available in our section on Witnesses
ga: Chun tuilleadh eolais a fháil ar bheith i do fhinné i gcás, brú ar Finnéithe
